

var country = new Array(
"USA","美国",
"China","中国大陆",
"Canada","加拿大",
"Europe","欧洲",
"Asia","东南亚",
"MetroChina","港澳台",
"Australia","澳大利亚",
"NewZealand","新西兰",
"Japan","日本",
"Korea","韩国",
"Others","其它地区"
) ;

var USA = new Array(
"Alabama" , "阿拉巴马",
"Alaska" , "阿拉斯加",
"Arizona" , "亚利桑那",
"Arkansas" , "阿肯色",
"California" , "加州",
"Colorado" , "科罗拉多",
"Connecticut" , "康州",
"Delaware" , "特拉华",
"Washington DC" , "华盛顿DC",
"Florida" , "佛罗里达",
"Georgia" , "佐治亚",
"Hawaii" , "夏威夷",
"Idaho" , "爱达荷",
"Illinois" , "伊利诺伊",
"Indiana" , "印第安纳",
"Iowa" , "艾奥瓦",
"Kansas" , "堪萨斯",
"Kentucky" , "肯塔基",
"Louisiana" , "路易斯安那",
"Maine" , "缅因",
"Maryland" , "马里兰",
"Massachusetts" , "麻省",
"Michigan" , "密歇根",
"Minnesota" , "明尼苏达",
"Mississippi" , "密西西比",
"Missouri" , "密苏里",
"Montana" , "蒙大拿",
"Nebraska" , "内布拉斯加",
"Nevada" , "内华达",
"New Hampshire" , "新罕布什尔",
"New Jersey" , "新泽西",
"New Mexico" , "新墨西哥",
"New York" , "纽约州",
"North Carolina" , "北卡",
"North Dakota" , "北达科他",
"Ohio" , "俄亥俄",
"Oklahoma" , "俄克拉何马",
"Oregon" , "俄勒冈",
"Pennsylvania" , "宾州",
"Rhode Island" , "罗得岛",
"South Carolina" , "南卡",
"South Dakota" , "南达科他",
"Tennessee" , "田纳西",
"Texas" , "德州",
"Utah" , "犹他",
"Vermont" , "佛蒙特",
"Virginia" , "弗吉尼亚",
"Washington" , "华盛顿州",
"West Virginia" , "西弗吉尼亚",
"Wisconsin" , "威斯康星",
"Wyoming" , "怀俄明") ;
var Canada = new Array(
"Toronto" , "多伦多地区",
"Vancouver" , "温哥华地区",
"Montreal" , "蒙特利尔地区",
"Ottawa" , "渥太华地区",
"Canada Others" , "其它地区") ;
var China = new Array(
"Beijing" , "北京",
"Shanghai" , "上海",
"Tianjin" , "天津",
"Chongqing" , "重庆",
"Anhui" , "安徽",
"Fujian" , "福建",
"Gansu" , "甘肃",
"Hebei" , "河北",
"Heilongjiang" , "黑龙江",
"Guangdong" , "广东",
"Guangxi" , "广西",
"Guizhou" , "贵州",
"Henan" , "河南",
"Hubei" , "湖北",
"Hunan" , "湖南",
"Hainan" , "海南",
"Jiangsu" , "江苏",
"Jiangxi" , "江西",
"Jilin" , "吉林",
"Liaoning" , "辽宁",
"Neimenggu" , "内蒙古",
"Ningxia" , "宁夏",
"Qinghai" , "青海",
"Shandong" , "山东",
"Shanxi" , "山西",
"Shaanxi" , "陕西",
"Sichuan" , "四川",
"Xinjiang" , "新疆",
"Xizang" , "西藏",
"Yunnan" , "云南",
"Zhejiang" , "浙江") ;
var MetroChina = new Array(
"Hongkong" , "香港",
"Macao" , "澳门",
"Taiwan" , "台湾") ;
var Europe = new Array(
"Britain" , "英国",
"France" , "法国",
"Germany" , "德国",
"Italy" , "意大利",
"Russia" , "俄罗斯",
"Sweden" , "瑞典",
"Switzerland" , "瑞士",
"Spain" , "西班牙",
"Finland" , "芬兰",
"Holland" , "荷兰",
"Austria" , "奥地利",
"Belgium" , "比利时",
"Bulgaria" , "保加利亚",
"Czech" , "捷克",
"Denmark" , "丹麦",
"Greece" , "西腊",
"Hungary" , "匈牙利",
"Iceland" , "冰岛",
"Ireland" , "爱尔兰",
"Norway" , "挪威",
"Poland" , "波兰",
"Portugal" , "葡萄牙",
"Romania" , "罗马尼亚",
"Yugoslavia" , "南斯拉夫",
"Europe Others" , "其它地区") ;

var Australia = new Array(
"Sydney" , "悉尼地区",
"Melbourne" , "墨尔本地区",
"Perth" , "佩思地区",
"Australia Others" , "其它地区") ;
var NewZealand = new Array(
"Wellington" , "惠灵顿地区",
"Dunedin" , "达尼丁地区",
"New Zealand Others" , "其它地区") ;
var Japan = new Array(
"Tokyo" , "东京地区",
"Nagoya" , "名古屋地区",
"Osaka" , "大阪地区",
"Sapporo" , "札幌地区",
"Sendai" , "仙台地区",
"Yokohama" , "横滨地区",
"Hokkaido" , "北海道地区",
"Japan Others" , "其它地区") ;
var Korea = new Array(
"Seoul" , "汉城地区",
"Taejon" , "大田地区",
"Kwangju" , "光州地区",
"Korea Others" , "其它地区") ;
var Asia = new Array(
"Singapore" , "新加坡",
"Malaysia" , "马来西亚",
"Philippine" , "菲律宾",
"Thailand" , "泰国",
"Indonesia" , "印度尼西亚",
"Vietnam" , "越南",
"Asia Others" , "其它地区") ;
var Others = new Array(
"South America" , "南美洲",
"Central America" , "中美洲",
"Middle East" , "中东",
"North Africa" , "北非",
"South Africa" , "南非",
"India" , "印度",
"Otherss" , "其它地区") ;

var Alabama = new Array(
"0" , "阿拉巴马" 
) ;


var Alaska = new Array(
"0" , "阿拉斯加"
 ) ;

var Arizona = new Array(
"0" , "亚利桑那"
 ) ;

var Arkansas = new Array(
"0" , "阿肯色"
) ;

var California = new Array(
"0" , "洛杉矶",
"1" , "旧金山",
"2" , "圣迭戈",
"3" , "其它地区" ) ;

var Colorado = new Array(
"0" , "丹佛",
"1" , "其它地区" ) ;

var Connecticut = new Array(
"0" , "纽黑文",
"1" , "其它地区" ) ;

var Delaware = new Array(
"0" , "特拉华"
 ) ;

var Washington = new Array(
"0" , "西雅图",
"1" , "其它地区" ) ;

var Florida = new Array(
"0" , "迈阿密",
"1" , "奥兰多",
"2" , "其它地区" ) ;

var Georgia = new Array(
"0" , "亚特兰大",
"1" , "其它地区" ) ;

var Hawaii = new Array(
"0" , "檀香山",
"1" , "其它地区" ) ;

var Idaho = new Array(
"0" , "爱达荷"
) ;

var Illinois = new Array(
"0" , "芝加哥",
"1" , "其它地区" ) ;

var Indiana = new Array(
"0" , "印第安纳"
 ) ;

var Iowa = new Array(
"0" , "艾奥瓦" ) ;

var Kansas = new Array(
"0" , "堪萨斯"
) ;

var Kentucky = new Array(
"0" , "肯塔基"
) ;

var Louisiana = new Array(
"0" , "新奥尔良",
"1" , "其它地区" ) ;

var Maine = new Array(
"0" , "波特兰",
"1" , "其它地区" ) ;

var Maine = new Array(
"0" , "缅因"
) ;

var Maryland = new Array(
"0" , "巴尔的摩",
"1" , "其它地区" ) ;

var Massachusetts = new Array(
"0" , "波士顿",
"1" , "渥铎斯特",
"2" , "其它地区" ) ;

var Michigan = new Array(
"0" , "底特律",
"1" , "其它地区" ) ;

var Minnesota = new Array(
"0" , "明尼苏达"
 ) ;

var Mississippi = new Array(
"0" , "密西西比") ;

var Missouri = new Array(
"0" , "密苏里" ) ;

var Montana = new Array(
"0" , "蒙大拿"
 ) ;

var Nebraska = new Array(
"0" , "内布拉斯加"
 ) ;

var Nevada = new Array(
"0" , "拉斯维加斯",
"1" , "其它地区" ) ;

var New_Hampshire = new Array(
"0" , "曼彻斯特",
"1" , "其它地区" ) ;

var New_Jersey = new Array(
"0" , "新泽西"
 ) ;

var New_Mexico = new Array(
"0" , "新墨西哥"
 ) ;

var New_York = new Array(
"0" , "纽约",
"1" , "其它地区" ) ;

var North_Carolina = new Array(
"0" , "北卡"
 ) ;

var North_Dakota = new Array(
"0" , "北达科他"
 ) ;

var Ohio = new Array(
"0" , "俄亥俄"
) ;

var Oklahoma = new Array(
"0" , "俄克拉何马"
 ) ;

var Oregon = new Array(
"0" , "俄勒冈"
) ;

var Pennsylvania = new Array(
"0" , "费城",
"1" , "匹兹堡",
"2" , "其它地区" ) ;

var Rhode_Island = new Array(
"0" , "罗得岛"
) ;

var South_Carolina = new Array(
"0" , "南卡"
 ) ;

var South_Dakota = new Array(
"0" , "南达科他"
 ) ;

var Tennessee = new Array(
"0" , "田纳西"
) ;

var Texas = new Array(
"0" , "休斯顿",
"1" , "达拉斯",
"2" , "奥斯汀",
"3" , "其它地区" ) ;

var Utah = new Array(
"0" , "犹他"
 ) ;

var Vermont = new Array(
"0" , "佛蒙特"
 ) ;

var Virginia = new Array(
"0" , "弗吉尼亚"
 ) ;

var Washington_DC = new Array(
"0" , "华盛顿DC"
) ;

var West_Virginia = new Array(
"0" , "西弗吉尼亚"
) ;

var Wisconsin = new Array(
"0" , "威斯康星"
 ) ;

var Wyoming = new Array(
"0" , "怀俄明"
 ) ;

var Toronto = new Array(
"0" , "多伦多地区") ;

var Vancouver = new Array(
"0" , "温哥华地区") ;

var Montreal = new Array(
"0" , "蒙特利尔地区") ;

var Ottawa = new Array(
"0" , "渥太华地区") ;

var Canada_Others = new Array(
"0" , "其它地区") ;

var Sydney = new Array(
"0" , "悉尼地区" ) ;

var Melbourne= new Array(
"0" , "墨尔本地区" ) ;

var Perth = new Array(
"0" , "佩思地区" ) ;

var Australia_Others = new Array(
"0" , "其它地区" ) ;

var Wellington = new Array(
"0" , "惠灵顿地区" ) ;

var Dunedin = new Array(
"0" , "达尼丁地区" ) ;

var New_Zealand_Others = new Array(
"0" , "其它地区" ) ;

var Tokyo = new Array(
"0" , "东京地区") ;

var Nagoya = new Array(
"0" , "名古屋地区") ;

var Osaka = new Array(
"0" , "大阪地区") ;

var Sendai = new Array(
"Sendai" , "仙台地区") ;

var Sapporo = new Array(
"Sapporo" , "札幌地区") ;

var Yokohama = new Array(
"0" , "横滨地区") ;

var Hokkaido = new Array(
"0" , "北海道地区") ;

var Japan_Others = new Array(
"0" , "其它地区") ;


var Seoul = new Array(
"0" , "汉城地区") ;

var Taejon = new Array(
"0" , "大田地区") ;

var Kwangju = new Array(
"0" , "光州地区") ;

var Korea_Others = new Array(
"0" , "其它地区") ;


var South_America = new Array(
"0" , "南美洲") ;

var Central_America = new Array(
"0" , "中美洲") ;

var Middle_East = new Array(
"0" , "中东") ;

var North_Africa = new Array(
"0" , "北非") ;

var South_Africa = new Array(
"0" , "南非") ;

var India = new Array(
"0" , "印度") ;

var Otherss = new Array(
"0" , "其它地区") ;

var Beijing = new Array(
"0" , "东城区",
"1" , "西城区",
"2" , "崇文区",
"3" , "宣武区",
"4" , "朝阳区",
"5" , "丰台区",
"6" , "石景山区",
"7" , "海淀区",
"8" , "门头沟区",
"9" , "房山区",
"10" , "通州区",
"11" , "顺义区",
"12" , "延庆县",
"13" , "昌平区",
"14" , "怀柔区",
"15" , "密云县",
"16" , "平谷区",
"17" , "大兴区",
"18" , "其它地区") ;

var Shanghai = new Array(
"0" , "黄浦区",
"1" , "卢湾区",
"2" , "徐汇区",
"3" , "长宁区",
"4" , "静安区",
"5" , "普陀区",
"6" , "闸北区",
"7" , "虹口区",
"8" , "杨浦区",
"9" , "闵行区",
"10" , "宝山区",
"11" , "嘉定区",
"12" , "浦东新区",
"13" , "金山区",
"14" , "松江区",
"15" , "崇明县",
"16" , "青浦区",
"17" , "南汇区",
"18" , "奉贤区",
"19" , "其它地区") ;

var Tianjin = new Array(
"0" , "和平区",
"1" , "河东区",
"2" , "河西区",
"3" , "南开区",
"4" , "河北区",
"5" , "红桥区",
"6" , "塘沽区",
"7" , "大港区",
"8" , "东丽区 ",
"9" , "西青区",
"10" , "津南区",
"11" , "北辰区",
"12" , "蓟县",
"13" , "宝坻区",
"14" , "武清区",
"15" , "宁河县",
"16" , "静海县",
"17" , "汉沽区",
"18" , "其它地区") ;

var Chongqing = new Array(
"0" , "渝中区",
"1" , "大渡口区",
"2" , "江北区",
"3" , "沙坪坝区",
"4" , "九龙坡区",
"5" , "南岸区",
"6" , "北碚区",
"7" , "万盛区",
"8" , "双桥区",
"9" , "渝北区",
"10" , "巴南区",
"11" , "万州区",
"12" , "涪陵区",
"13" , "合川市",
"14" , "永川市",
"15" , "江津市",
"16" , "南川市",
"17" , "长寿区",
"18" , "綦江县",
"19" , "潼南县",
"20" , "铜梁县",
"21" , "大足县",
"22" , "荣昌县",
"23" , "璧山县",
"24" , "垫江县",
"25" , "武隆县",
"26" , "丰都县",
"27" , "城口县",
"28" , "梁平县",
"29" , "黔江区",
"30" , "奉节县",
"31" , "开县",
"32" , "云阳县",
"33" , "忠县",
"34" , "巫溪县",
"35" , "巫山县",
"36" , "石柱土家族自治县",
"37" , "秀山土家族苗族自治县",
"36" , "酉阳土家族苗族自治县",
"37" , "彭水苗族土家族自治县",
"38" , "其它地区") ;

var Anhui = new Array(
"0" , "合肥市",
"1" , "宿州市",
"2" , "淮北市",
"3" , "阜阳市",
"4" , "蚌埠市",
"5" , "淮南市",
"6" , "滁州市",
"7" , "马鞍山市",
"8" , "芜湖市",
"9" , "铜陵市",
"10" , "安庆市",
"11" , "黄山市",
"12" , "六安市",
"13" , "巢湖市",
"14" , "池州市",
"15" , "宣城市",
"16" , "亳州市",
"17" , "其它地区") ;

var Fujian = new Array( 
"0" , "福州市",
"1" , "南平市",
"2" , "三明市",
"3" , "莆田市",
"4" , "泉州市",
"5" , "厦门市",
"6" , "漳州市",
"7" , "龙岩市",
"8" , "宁德市",
"9" , "其它地区") ;

var Gansu = new Array( 
"0" , "兰州市",
"1" , "嘉峪关市",
"2" , "金昌市",
"3" , "白银市",
"4" , "天水市",
"5" , "酒泉市",
"6" , "张掖市",
"7" , "武威市",
"8" , "庆阳市",
"9" , "平凉市",
"10" , "定西市",
"11" , "陇南地区",
"12" , "临夏回族自治州",
"13" , "甘南藏族自治州",
"14" , "玉门市",
"15" , "敦煌市",
"16" , "其它地区") ;

var Hebei = new Array( 
"0" , "石家庄市",
"1" , "张家口市",
"2" , "承德市",
"3" , "秦皇岛市",
"4" , "唐山市",
"5" , "廊坊市",
"6" , "保定市",
"7" , "沧州市",
"8" , "衡水市",
"9" , "邢台市",
"10" , "邯郸市",
"11" , "其它地区") ;

var Heilongjiang = new Array( 
"0" , "哈尔滨市",
"1" , "齐齐哈尔市",
"2" , "黑河市",
"3" , "大庆市",
"4" , "伊春市",
"5" , "鹤岗市",
"6" , "佳木斯市",
"7" , "双鸭山市",
"8" , "七台河市",
"9" , "鸡西市",
"10" , "牡丹江市",
"11" , "绥化地区",
"12" , "大兴安岭地区",
"13" , "其它地区") ;

var Guangdong = new Array(
"0" , "广州市",
"1" , "清远市",
"2" , "韶关市",
"3" , "河源市",
"4" , "梅州市",
"5" , "潮州市",
"6" , "汕头市",
"7" , "揭阳市",
"8" , "汕尾市",
"9" , "惠州市",
"10" , "东莞市",
"11" , "深圳市",
"12" , "珠海市",
"13" , "中山市",
"14" , "江门市",
"15" , "佛山市",
"16" , "肇庆市",
"17" , "云浮市",
"18" , "阳江市",
"19" , "茂名市",
"20" , "湛江市",
"21" , "其它地区") ;

var Guangxi = new Array( 
"0" , "南宁市",
"1" , "桂林市",
"2" , "柳州市",
"3" , "梧州市",
"4" , "贵港市",
"5" , "玉林市",
"6" , "钦州市",
"7" , "北海市",
"8" , "防城港市",
"9" , "百色市",
"10" , "河池地区",
"11" , "贺州地区",
"12" , "崇左市",
"13" , "凭祥市",
"14" , "来宾市",
"15" , "其它地区") ;

var Guizhou = new Array( 
"0" , "贵阳市",
"1" , "六盘水市",
"2" , "遵义市",
"3" , "毕节地区",
"4" , "铜仁地区",
"5" , "安顺市",
"6" , "黔东南苗族侗族自治州",
"7" , "黔南布依族苗族自治州",
"8" , "黔西南布依族苗族自治州",
"9" , "其它地区") ;

var Henan = new Array(
"0" , "郑州市",
"1" , "三门峡市",
"2" , "洛阳市",
"3" , "焦作市",
"4" , "新乡市",
"5" , "鹤壁市",
"6" , "安阳市",
"7" , "濮阳市",
"8" , "开封市",
"9" , "商丘市",
"10" , "许昌市",
"11" , "漯河市",
"12" , "平顶山市",
"13" , "南阳市",
"14" , "信阳市",
"15" , "济源市",
"16" , "周口市",
"17" , "驻马店市",
"18" , "其它地区") ;

var Hubei = new Array( 
"0" , "武汉市",
"1" , "十堰市",
"2" , "襄樊市",
"3" , "荆门市",
"4" , "孝感市",
"5" , "黄冈市",
"6" , "鄂州市",
"7" , "黄石市",
"8" , "咸宁市",
"9" , "荆州市",
"10" , "宜昌市",
"11" , "随州市",
"12" , "仙桃市",
"13" , "天门市",
"14" , "潜江市",
"15" , "神农架林区",
"16" , "恩施土家族苗族自治州",
"17" , "其它地区") ;

var Hunan = new Array( 
"0" , "长沙市",
"1" , "张家界市",
"2" , "常德市",
"3" , "益阳市",
"4" , "岳阳市",
"5" , "株洲市",
"6" , "湘潭市",
"7" , "衡阳市",
"8" , "郴州市",
"9" , "永州市",
"10" , "邵阳市",
"11" , "怀化市",
"12" , "娄底市",
"13" , "湘西土家族苗族自治州",
"14" , "其它地区") ;

var Hainan = new Array( 
"0" , "海口市",
"1" , "三亚市",
"2" , "琼山市",
"3" , "文昌市",
"4" , "琼海市",
"5" , "万宁市",
"6" , "东方市",
"7" , "儋州市",
"8" , "临高县",
"9" , "澄迈县",
"10" , "定安县",
"11" , "屯昌县",
"12" , "昌江黎族自治县",
"13" , "白沙黎族自治县",
"14" , "琼中黎族苗族自治县",
"15" , "陵水黎族自治县",
"16" , "保亭黎族苗族自治县",
"17" , "乐东黎族自治县",
"18" , "五指山市",
"19" , "其它地区") ;

var Jiangsu = new Array(
"0" , "南京市",
"1" , "徐州市",
"2" , "连云港市",
"3" , "宿迁市",
"4" , "淮阴市",
"5" , "盐城市",
"6" , "扬州市",
"7" , "泰州市",
"8" , "南通市",
"9" , "镇江市",
"10" , "常州市",
"11" , "无锡市",
"12" , "苏州市",
"13" , "淮安市",
"14" , "其它地区") ;

var Jiangxi = new Array(
"0" , "南昌市",
"1" , "九江市",
"2" , "景德镇市",
"3" , "鹰潭市",
"4" , "新余市",
"5" , "萍乡市",
"6" , "赣州市",
"7" , "上饶市",
"8" , "抚州市",
"9" , "宜春市",
"10" , "吉安市",
"11" , "其它地区") ;

var Jilin = new Array( 
"0" , "长春市",
"1" , "白城市",
"2" , "松原市",
"3" , "吉林市",
"4" , "四平市",
"5" , "辽源市",
"6" , "通化市",
"7" , "白山市",
"8" , "延边朝鲜族自治州",
"9" , "其它地区") ;

var Liaoning = new Array( 
"0" , "沈阳市",
"1" , "朝阳市",
"2" , "阜新市",
"3" , "铁岭市",
"4" , "抚顺市",
"5" , "本溪市",
"6" , "辽阳市",
"7" , "鞍山市",
"8" , "丹东市",
"9" , "大连市",
"10" , "营口市",
"11" , "盘锦市",
"12" , "锦州市",
"13" , "葫芦岛市",
"14" , "其它地区" ) ;

var Neimenggu = new Array( 
"0" , "呼和浩特市",
"1" , "包头市",
"2" , "乌海市",
"3" , "赤峰市",
"4" , "呼伦贝尔",
"5" , "兴安盟",
"6" , "锡林郭勒盟",
"7" , "乌兰察布市",
"8" , "巴彦淖尔市",
"9" , "阿拉善盟",
"10" , "鄂尔多斯市",
"11" , "通辽市",
"12" , "其它地区") ;

var Ningxia = new Array( 
"0" , "银川市",
"1" , "石嘴山市",
"2" , "吴忠市",
"3" , "固原市",
"4" , "其它地区") ;

var Qinghai = new Array( 
"0" , "西宁市",
"1" , "海东地区",
"2" , "海北藏族自治州",
"3" , "海南藏族自治州",
"4" , "黄南藏族自治州",
"5" , "果洛藏族自治州",
"6" , "玉树藏族自治州",
"7" , "海西蒙古族藏族自治州",
"8" , "其它地区") ;

var Shandong = new Array( 
"0" , "济南市",
"1" , "聊城市",
"2" , "德州市",
"3" , "东营市",
"4" , "淄博市",
"5" , "潍坊市",
"6" , "烟台市",
"7" , "威海市",
"8" , "青岛市",
"9" , "日照市",
"10" , "临沂市",
"11" , "枣庄市",
"12" , "济宁市",
"13" , "泰安市",
"14" , "莱芜市",
"15" , "滨州市",
"16" , "菏泽市",
"17" , "其它地区") ;

var Shanxi = new Array( 
"0" , "太原市",
"1" , "大同市",
"2" , "朔州市",
"3" , "阳泉市",
"4" , "长治市",
"5" , "晋城市",
"6" , "忻州市",
"7" , "吕梁市",
"8" , "晋中市",
"9" , "临汾市",
"10" , "运城市",
"11" , "其它地区") ;

var Shaanxi = new Array( 
"0" , "西安市",
"1" , "延安市",
"2" , "铜川市",
"3" , "渭南市",
"4" , "咸阳市",
"5" , "宝鸡市",
"6" , "汉中市",
"7" , "榆林市",
"8" , "商洛市",
"9" , "安康市",
"10" , "其它地区") ;

var Sichuan = new Array( 
"0" , "成都市",
"1" , "广元市",
"2" , "绵阳市",
"3" , "德阳市",
"4" , "南充市",
"5" , "广安市",
"6" , "遂宁市",
"7" , "内江市",
"8" , "乐山市",
"9" , "自贡市",
"10" , "泸州市",
"11" , "宜宾市",
"12" , "攀枝花市",
"13" , "巴中市",
"14" , "达州市",
"15" , "资阳市",
"16" , "眉山市",
"17" , "雅安市",
"18" , "阿坝藏族羌族自治州",
"19" , "甘孜藏族自治州",
"20" , "凉山彝族自治州",
"21" , "其它地区") ;

var Xinjiang = new Array( 
"0" , "乌鲁木齐市",
"1" , "克拉玛依市",
"2" , "石河子市",
"3" , "喀什地区",
"4" , "阿克苏地区",
"5" , "和田地区",
"6" , "吐鲁番地区",
"7" , "哈密地区",
"8" , "克孜勒苏柯尔克孜自治州",
"9" , "博尔塔拉蒙古自治州",
"10" , "昌吉回族自治州",
"11" , "巴音郭楞蒙古自治州",
"12" , "伊犁哈萨克自治州",
"13" , "其它地区") ;

var Xizang = new Array( 
"0" , "拉萨市",
"1" , "那曲地区",
"2" , "昌都地区",
"3" , "林芝地区",
"4" , "山南地区",
"5" , "日喀则地区",
"6" , "阿里地区",
"7" , "其它地区") ;

var Yunnan = new Array( 
"0" , "昆明市",
"1" , "曲靖市",
"2" , "玉溪市",
"3" , "丽江市",
"4" , "昭通市",
"5" , "思茅市",
"6" , "临沧地区",
"7" , "保山市",
"8" , "德宏傣族景颇族自治州",
"9" , "怒江傈傈族自治州",
"10" , "迪庆藏族自治州",
"11" , "大理白族自治州",
"12" , "楚雄彝族自治州",
"13" , "红河哈尼族彝族自治州",
"14" , "文山壮族苗族自治州",
"15" , "西双版纳傣族自治州",
"16" , "其它地区") ;

var Zhejiang = new Array( 
"0" , "杭州市",
"1" , "湖州市",
"2" , "嘉兴市",
"3" , "舟山市",
"4" , "宁波市",
"5" , "绍兴市",
"6" , "金华市",
"7" , "台州市",
"8" , "温州市",
"9" , "丽水市",
"10" , "衢州市",
"11" , "其它地区") ;

var Hongkong = new Array( 
"0" , "九龙城区",
"1" , "中西区",
"2" , "东区",
"3" , "观塘区",
"4" , "南区",
"5" , "深水*区",
"6" , "黄大仙区",
"7" , "湾仔区",
"8" , "油尖旺区",
"9" , "离岛区",
"10" , "葵青区",
"11" , "北区",
"12" , "西贡区",
"13" , "沙田区",
"14" , "屯门区",
"15" , "大埔区",
"16" , "元朗区",
"17" , "其它地区") ;

var Macao = new Array(
"0" , "澳门半岛",
"1" , "凼仔岛",
"2" , "路环岛",
"3" , "其它地区") ;

var Taiwan = new Array(
"0" , "台北市",
"1" , "高雄市",
"2" , "台南市",
"3" , "台中市",
"4" , "基隆市",
"5" , "新竹市",
"6" , "嘉义市",
"7" , "台北县",
"8" , "宜兰县",
"9" , "新竹县",
"10" , "桃园县",
"11" , "苗栗县",
"12" , "台中县",
"13" , "彰化县",
"14" , "南投县",
"15" , "嘉义县",
"16" , "云林县",
"17" , "台南县",
"18" , "高雄县",
"19" , "屏东县",
"20" , "台东县",
"21" , "花莲县",
"22" , "澎湖县",
"23" , "其它地区") ;

var Britain = new Array(
"0" , "伦敦",
"1" , "其它地区") ;

var France = new Array(
"0" , "巴黎",
"1" , "其它地区") ;

var Germany = new Array(
"0" , "柏林",
"1" , "其它地区") ;

var Italy = new Array(
"0" , "罗马",
"1" , "其它地区") ;

var Russia = new Array(
"0" , "莫斯科",
"1" , "其它地区") ;

var Sweden = new Array(
"0" , "斯德哥尔摩",
"1" , "其它地区") ;

var Switzerland = new Array(
"0" , "日内瓦",
"1" , "其它地区") ;

var Spain = new Array(
"0" , "马德里",
"1" , "其它地区") ;

var Finland = new Array(
"0" , "赫尔辛基",
"1" , "其它地区") ;

var Holland = new Array(
"0" , "荷兰") ;

var Austria = new Array(
"0" , "维也纳",
"1" , "其它地区") ;

var Belgium = new Array(
"0" , "布鲁塞尔",
"1" , "其它地区") ;

var Bulgaria = new Array( 
"0" , "保加利亚"
) ;

var Czech = new Array(
"0" , "布拉格" ,
"1" , "其它地区"
) ;

var Denmark = new Array(
"0" , "丹麦"
) ;

var Greece = new Array(
"0" , "雅典",
"1" , "其它地区") ;

var Hungary = new Array(
"0" , "布达佩斯",
"1" , "其它地区") ;

var Iceland = new Array(
"0" , "冰岛"
) ;

var Ireland = new Array(
"0" , "都柏林",
"1" , "其它地区") ;

var Norway = new Array(
"0" , "挪威"
) ;

var Poland = new Array(
"0" , "华沙",
"1" , "其它地区") ;

var Portugal = new Array(
"0" , "里斯本",
"1" , "其它地区") ;

var Romania = new Array(
"0" , "罗马尼亚"
) ;

var Yugoslavia = new Array(
"0" , "南斯拉夫"
) ;

var Europe_Others = new Array(
"0" , "其它地区" 
) ;

var Singapore = new Array(
"0" , "新加坡"
) ;

var Malaysia = new Array(
"0" , "吉隆坡",
"1" , "其它地区") ;

var Philippine = new Array(
"0" , "马尼拉",
"1" , "其它地区") ;

var Thailand = new Array(
"0" , "曼谷",
"1" , "其它地区") ;

var Indonesia = new Array(
"0" , "雅加达",
"1" , "其它地区") ;

var Vietnam = new Array(
"0" , "河内",
"1" , "其它地区") ;

var Asia_Others = new Array(
"0" , "其它地区" 
) ;

var sheng_xiao = new Array(
"Mice","鼠 (36, 48, 60, 72, 84)",
"Ox","牛 (37, 49, 61, 73, 85)",
"Tiger","虎 (38, 50, 62, 74, 86)", 
"Rabbit","兔 (39, 51, 63, 75, 87)",
"Dragon","龙 (40, 52, 64, 76, 88)",
"Snake","蛇 (41, 53, 65, 77, 89)",
"Horse","马 (42, 54, 66, 78, 90)",
"Sheep","羊 (43, 55, 67, 79, 91)",
"Monkey","猴 (44, 56, 68, 80, 92)",
"Rooster","鸡 (45, 57, 69, 81, 93)",
"Dog","狗 (46, 58, 70, 82, 94)",
"Boar","猪 (47, 59, 71, 83, 95)"
) ;					  

var astrology = new Array(
"Aries","白羊座 (03/21-04/19)",
"Taurus","金牛座 (04/20-05/20)",
"Gemini","双子座 (05/21-06/21)",
"Cancer","巨蟹座 (06/22-07/22)",
"Leo","狮子座 (07/23-08/22)",
"Virgo","处女座 (08/23-09/22)",
"Libra","天秤座 (09/23-10/23)",
"Scorpio","天蝎座 (10/24-11/21)",
"Sagittarius","射手座 (11/22-12/21)",
"Capricorn","摩羯座 (12/22-01/19)",
"Aquarius","宝瓶座 (01/20-02/18)",
"Pisces","双鱼座 (02/19-03/20)"
) ;					  

var blood_type = new Array(
"A","A型",
"B","B型",
"AB","AB型",
"O","O型"
) ;

var appearance = new Array(
"Very good","很好",
"Good","好",
"Above Normal","较好",
"Normal","普通",
"Below normal","普通偏下"
) ;

var degree = new Array(
"Doctoral","博士",
"Master","硕士",
"Bachelor","大学",
"Junior college","大专",
"Below junior college","大专以下"
) ;



var occupation = new Array(
"Student","学生",
"Education","教育/科研",
"IT","电脑/IT",
"Engineer","技术/工程",
"Financial","财经/保险",
"Management","管理/商业",
"Law","法律",
"Medical","医药",
"Sales","销售/市场",
"Media","新闻/媒体",
"Art","艺术/体育",
"Government","政府/军队",
"Food","饮食/服务",
"Others","其它"
) ;

var income = new Array(
"Below 1500","$1,500 以下",
"1500-7000","$1,500 - $7,000",
"7000-15000","$7,000 - $15,000",
"15000-30000","$15,000 - $30,000",
"30000-50000","$30,000 - $50,000",
"50000-80000","$50,000 - $80,000",
"80000-100000","$80,000 - $100,000",
"100000-150000","$100,000 - $150,000",
"Above 150000","$150,000 以上"
) ;

var work_years = new Array(
"Below 1","1年以下",
"1-3","1 - 3年",
"4-6","4 - 6年",
"7-9","7 - 9年" ,
"10-15","10 - 15年" ,
"16-20","16 - 20年" ,
"Above 20","20年以上"
) ;


var purpose = new Array(
"Long term relationship" , "终身伴侣" ,
"boy girl relationship"   , "男女朋友" ,
"Short term relationship" , "浪漫关系" ,
"Life friends" , "生活中的朋友" ,
"Career friends" , "职业上的朋友"

) ;

var clubtype = new Array(

"Heart","感情",
"Women","女性",
"Sports","体育",
"Games","游戏",
"Entertainment","娱乐",
"Music","音乐",
"Hobby","爱好",
"Living","生活",
"Politics","时政",
"Science and Technology","科技",
"Finance","财经",
"Alumni","校友",
"Fellow","同乡",
"Region","地区",
"Literature","文学",
"Art","艺术",
"Religion","信仰",
"Sex","性爱",
"Others","其它"
) ;

var age= new Array(
"18","18",
"19","19",
"20","20",
"21","21",
"22","22",
"23","23",
"24","24",
"25","25",
"26","26",
"27","27",
"28","28",
"29","29",
"30","30",
"31","31",
"32","32",
"33","33",
"34","34",
"35","35",
"36","36",
"37","37",
"38","38",
"39","39",
"40","40",
"41","41",
"42","42",
"43","43",
"44","44",
"45","45",
"46","46",
"47","47",
"48","48",
"49","49",
"50","50",
"51","51",
"52","52",
"53","53",
"54","54",
"55","55",
"56","56",
"57","57",
"58","58",
"59","59",
"60","60",
"61","61",
"62","62",
"63","63",
"64","64",
"65","65",
"66","66",
"67","67",
"68","68",
"69","69",
"70","70",
"71","71",
"72","72",
"73","73",
"74","74",
"75","75",
"76","76",
"77","77",
"78","78",
"79","79",
"80","80",
"81","81",
"82","82",
"83","83",
"84","84",
"85","85",
"86","86",
"87","87",
"88","88",
"89","89",
"90","90",
"91","91",
"92","92",
"93","93",
"94","94",
"95","95",
"96","96",
"97","97",
"98","98",
"99","99",
"100","100"
) ;
var year= new Array(
"1960","1960",
"1961","1961",
"1962","1962",
"1963","1963",
"1964","1964",
"1965","1965",
"1966","1966",
"1967","1967",
"1968","1968",
"1969","1969",
"1970","1970",
"1971","1971",
"1972","1972",
"1973","1973",
"1974","1974",
"1975","1975",
"1976","1976",
"1977","1977",
"1978","1978",
"1979","1979",
"1980","1980",
"1981","1981",
"1982","1982",
"1983","1983",
"1984","1984",
"1985","1985",
"1986","1986",
"1987","1987",
"1988","1988",
"1989","1989",
"1990","1990",
"1991","1991",
"1992","1992",
"1993","1993",
"1994","1994",
"1995","1995",
"1996","1996",
"1997","1997",
"1998","1998",
"1999","1999",
"2000","2000",
"2001","2001",
"2002","2002",
"2003","2003",
"2004","2004",
"2005","2005"
);
var month= new Array(
"02","02",
"03","03",
"04","04",
"05","05",
"06","06",
"07","07",
"08","08",
"09","09",
"10","10",
"11","11",
"12","12"
);
var day= new Array(
"02","02",
"03","03",
"04","04",
"05","05",
"06","06",
"07","07",
"08","08",
"09","09",
"10","10",
"11","11",
"12","12",
"13","13",
"14","14",
"15","15",
"16","16",
"17","17",
"18","18",
"19","19",
"20","20",
"21","21",
"22","22",
"23","23",
"24","24",
"25","25",
"26","26",
"27","27",
"28","28",
"29","29",
"30","30",
"31","31"
);

var height= new Array(
"100","100",
"101","101",
"102","102",
"103","103",
"104","104",
"105","105",
"106","106",
"107","107",
"108","108",
"109","109",
"110","110",
"111","111",
"112","112",
"113","113",
"114","114",
"115","115",
"116","116",
"117","117",
"118","118",
"119","119",
"120","120",
"121","121",
"122","122",
"123","123",
"124","124",
"125","125",
"126","126",
"127","127",
"128","128",
"129","129",
"130","130",
"131","131",
"132","132",
"133","133",
"134","134",
"135","135",
"136","136",
"137","137",
"138","138",
"139","139",
"140","140",
"141","141",
"142","142",
"143","143",
"144","144",
"145","145",
"146","146",
"147","147",
"148","148",
"149","149",
"150","150",
"151","151",
"152","152",
"153","153",
"154","154",
"155","155",
"156","156",
"157","157",
"158","158",
"159","159",
"160","160",
"161","161",
"162","162",
"163","163",
"164","164",
"165","165",
"166","166",
"167","167",
"168","168",
"169","169",
"170","170",
"171","171",
"172","172",
"173","173",
"174","174",
"175","175",
"176","176",
"177","177",
"178","178",
"179","179",
"180","180",
"181","181",
"182","182",
"183","183",
"184","184",
"185","185",
"186","186",
"187","187",
"188","188",
"189","189",
"190","190",
"191","191",
"192","192",
"193","193",
"194","194",
"195","195",
"196","196",
"197","197",
"198","198",
"199","199",
"200","200",
"201","201",
"202","202",
"203","203",
"204","204",
"205","205",
"206","206",
"207","207",
"208","208",
"209","209",
"210","210",
"211","211",
"212","212",
"213","213",
"214","214",
"215","215",
"216","216",
"217","217",
"218","218",
"219","219",
"220","220",
"221","221",
"222","222",
"223","223",
"224","224",
"225","225",
"226","226",
"227","227",
"228","228",
"229","229",
"230","230",
"231","231",
"232","232",
"233","233",
"234","234",
"235","235",
"236","236",
"237","237",
"238","238",
"239","239",
"240","240",
"241","241",
"242","242",
"243","243",
"244","244",
"245","245",
"246","246",
"247","247",
"248","248",
"249","249",
"250","250"
) ;

var weight= new Array(
"25","25",
"26","26",
"27","27",
"28","28",
"29","29",
"30","30",
"31","31",
"32","32",
"33","33",
"34","34",
"35","35",
"36","36",
"37","37",
"38","38",
"39","39",
"40","40",
"41","41",
"42","42",
"43","43",
"44","44",
"45","45",
"46","46",
"47","47",
"48","48",
"49","49",
"50","50",
"51","51",
"52","52",
"53","53",
"54","54",
"55","55",
"56","56",
"57","57",
"58","58",
"59","59",
"60","60",
"61","61",
"62","62",
"63","63",
"64","64",
"65","65",
"66","66",
"67","67",
"68","68",
"69","69",
"70","70",
"71","71",
"72","72",
"73","73",
"74","74",
"75","75",
"76","76",
"77","77",
"78","78",
"79","79",
"80","80",
"81","81",
"82","82",
"83","83",
"84","84",
"85","85",
"86","86",
"87","87",
"88","88",
"89","89",
"90","90",
"91","91",
"92","92",
"93","93",
"94","94",
"95","95",
"96","96",
"97","97",
"98","98",
"99","99",
"100","100",
"101","101",
"102","102",
"103","103",
"104","104",
"105","105",
"106","106",
"107","107",
"108","108",
"109","109",
"110","110",
"111","111",
"112","112",
"113","113",
"114","114",
"115","115",
"116","116",
"117","117",
"118","118",
"119","119",
"120","120",
"121","121",
"122","122",
"123","123",
"124","124",
"125","125",
"126","126",
"127","127",
"128","128",
"129","129",
"130","130",
"131","131",
"132","132",
"133","133",
"134","134",
"135","135",
"136","136",
"137","137",
"138","138",
"139","139",
"140","140",
"141","141",
"142","142",
"143","143",
"144","144",
"145","145",
"146","146",
"147","147",
"148","148",
"149","149",
"150","150",
"151","151",
"152","152",
"153","153",
"154","154",
"155","155",
"156","156",
"157","157",
"158","158",
"159","159",
"160","160",
"161","161",
"162","162",
"163","163",
"164","164",
"165","165",
"166","166",
"167","167",
"168","168",
"169","169",
"170","170",
"171","171",
"172","172",
"173","173",
"174","174",
"175","175",
"176","176",
"177","177",
"178","178",
"179","179",
"180","180",
"181","181",
"182","182",
"183","183",
"184","184",
"185","185",
"186","186",
"187","187",
"188","188",
"189","189",
"190","190",
"191","191",
"192","192",
"193","193",
"194","194",
"195","195",
"196","196",
"197","197",
"198","198",
"199","199",
"200","200"
) ;


function change_region( state_select, country_name )
{
	var state_array ;
	var state_select_num ;
	var i ;
	var city_array ;
	state_select.selectedIndex = 0 ;
	if( country_name == "Not set" )
	{
		state_select.options.length = 1 ;
//		state_select.options[0].value = "Not set" ;
//		state_select.options[0].text = "-- 州/省 --" ;
				
		return ;	
	}
	country_name = country_name.replace(" " , "_" ) ;
	country_name = country_name.replace(" " , "_" ) ;
	state_array = eval( country_name ) ;
	state_select_num = state_array.length/2 +1 ;
	
	state_select.options.length = state_select_num ;
	for( i=1 ; i<state_select_num ; i++ )
	{
		state_select.options[i].value = state_array[(i-1)*2] ;
		state_select.options[i].text = state_array[(i-1)*2+1] ;
	}
}

function set_select_options( select_name, array , selected_option )
{
	var select_num ;
	var i ;
	
	select_num = array.length/2 +1 ;
	
	select_name.options.length = select_num ;
	select_name.selectedIndex = 0 ;
	for( i=1 ; i<select_num ; i++ )
	{
		select_name.options[i].value = array[(i-1)*2] ;
		select_name.options[i].text = array[(i-1)*2+1] ;
		
		if( array[(i-1)*2] == selected_option )
			select_name.selectedIndex = i ;	
	}
}

function change_regions( state_select, city_select , country_name )
{
	var state_array ;
	var state_select_num ;
	var i ;
	
	change_region( city_select , "Not set") ;
	state_select.selectedIndex = 0 ;
	
	if( country_name == "Not set" )
	{
		state_select.options.length = 1 ;	
		
		return ;	
	}
	
	state_array = eval( country_name ) ;
	state_select_num = state_array.length/2 +1 ;
	
	state_select.options.length = state_select_num ;
	for( i=1 ; i<state_select_num ; i++ )
	{
		state_select.options[i].value = state_array[(i-1)*2] ;
		state_select.options[i].text = state_array[(i-1)*2+1] ;
	}
	
		
}

function checkhtml(object , object1 , object2 , object3 , object4 , object5 )
{
	
	var r ;
	if ( object )
	{
		r = object.match(/\<.*?>/ig,"");
		if ( r ) 
		{
			alert("标题不允许含有javascript及html标记!!") ;
			return false;
		}
	}
	
	if ( object1 )
	{
		r = object1.match(/\<.*?>/ig,"");
		if ( r ) 
		{
			alert("标题不允许含有javascript及html标记!!") ;
			return false;
		}
	}
	
	if ( object2)
	{
		r = object2.match(/\<.*?>/ig,"");
		if ( r ) 
		{
			alert("标题不允许含有javascript及html标记!!") ;
			return false;
		}
	}
	if ( object3 )
	{
		r = object3.match(/(<|<\/)(html|body|pre|iframe|head|script|embed|meta|form|noscript)[\w|\t|\r|\W]*/i) ;
		if ( r ) 
		{
			alert("内容不允许含有javascript及特殊html标记(编辑器提供以外的标记)!") ;
			return false;
		}
	}
	
	if ( object4 )
	{
		r = object4.match(/(<|<\/)(html|body|pre|iframe|head|script|embed|meta|form|noscript)[\w|\t|\r|\W]*/i) ;
		if ( r ) 
		{
			alert("内容不允许含有javascript及特殊html标记(编辑器提供以外的标记)!") ;
			return false;
		}
	}
	
	object5.value = true ;
	
	return true ;
}

function set_textarea_value( textarea1 )
{
	textarea1.value = editor.getHTML();
	return true ;	
}
